yii framework project/models/Account.php

SELECT * FROM `account` WHERE `username`='yuchen'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `account` WHERE `email` IS NULL
---
    public static function fingdByEmail($email)
    {
        return static::findOne(['email' => $email]);